Revit 2027 API
BuiltInFailures.PlanRegionFailures.DeletedViewRangeLevel Property
 Deleted level was used to define plan region's view range.\r\nReplace deleted level by level of parent view and adjust offset?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletedViewRangeLevel { get; }
Public Shared ReadOnly Property DeletedViewRangeLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletedViewRangeLevel {
	FailureDefinitionId^ get ();
}
static member DeletedViewRangeLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PlanRegionFailures Class
Autodesk.Revit.DB Namespace